ace-stratton/ES-SDK/6.0.4.sdk/espf/arch/stm32h753iit/drivers/sensors/acc_ais328dq/ais328dq_driver.c
/*
 * Copyright (c) 2020-2022 EnduroSat AD. All rights reserved.
 *
 * Contents and presentations are protected world-wide.
 * Any kind of using, copying etc. is prohibited without prior permission.
 */
/**
 * @addtogroup acc_ais328dq AIS328DQ
 * @{
 *
 * @file     ais328dq_driver.c
 * @brief    Accelerometer AIS328DQ driver implementation
 *
 * @}
 *
 */

#include "ais328dq_driver.h"
#include "stm32h7xx_hal.h"
#include "main.h"
#include "MCU_Init.h"
#include <stdio.h>
#include "MX_I2C.h"

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/

status_t AIS328DQ_Init(uint8_t deviceAddress)
{
  uint8_t val;
  
  //set ODR (turn ON device)
  if (AIS328DQ_SetODR(deviceAddress, AIS328DQ_ODR_100Hz) != SEN_SUCCESS)
    return SEN_ERROR;
  
  //get sensor ID
  if (AIS328DQ_GetWHO_AM_I(deviceAddress, &val) != SEN_SUCCESS)
    return SEN_ERROR;
  
  //set PowerMode
  if (AIS328DQ_SetMode(deviceAddress, AIS328DQ_NORMAL) != SEN_SUCCESS)
    return SEN_ERROR;
  
  //set Fullscale
  if (AIS328DQ_SetFullScale(deviceAddress, AIS328DQ_FULLSCALE_2) != SEN_SUCCESS)
    return SEN_ERROR;    
  
  //set axis Enable
  if (AIS328DQ_SetAxis(deviceAddress, AIS328DQ_X_ENABLE | AIS328DQ_Y_ENABLE |  AIS328DQ_Z_ENABLE) != SEN_SUCCESS)
    return SEN_ERROR;    
  
  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name		: AIS328DQ_ReadReg
* Description		: Generic Reading function. It must be fullfilled with either
*			: I2C or SPI reading functions					
* Input			: Register Address
* Output		: Data Read
* Return		: Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
uint8_t AIS328DQ_ReadReg(uint8_t deviceAddr, uint8_t Reg, uint8_t* Data)
{
    HAL_StatusTypeDef I2C_retStat;
#if 1
    I2C_retStat = MX_I2C_Take(MX_I2C_BUS_SYSTEM,50);
    if(I2C_retStat == HAL_OK)
    {
        I2C_retStat = MX_I2C_BlockingMemRead(MX_I2C_BUS_SENSORS, deviceAddr>>1, Reg, sizeof(uint8_t), Data, sizeof(uint8_t));

        MX_I2C_Release(MX_I2C_BUS_SYSTEM);
    }
    if(I2C_retStat != HAL_OK)
    {
        return SEN_ERROR;
    }
#else
    if (HAL_OK != HAL_I2C_Mem_Read(&SENSORS_I2C_HANDLER, deviceAddr, Reg, 1, Data, 1, 10))
      return SEN_ERROR;
#endif

  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name		: AIS328DQ_WriteReg
* Description		: Generic Writing function. It must be fullfilled with either
*			: I2C or SPI writing function
* Input			: Register Address, Data to be written
* Output		: None
* Return		: Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_WriteReg(uint8_t deviceAddress, uint8_t WriteAddr, uint8_t Data)
{
    HAL_StatusTypeDef I2C_retStat;
#if 1
    I2C_retStat = MX_I2C_Take(MX_I2C_BUS_SYSTEM,50);
    if(I2C_retStat == HAL_OK)
    {
        I2C_retStat = MX_I2C_BlockingMemWrite(MX_I2C_BUS_SENSORS, deviceAddress>>1, WriteAddr, sizeof(uint8_t), &Data, sizeof(uint8_t));

        MX_I2C_Release(MX_I2C_BUS_SYSTEM);
    }
    if(I2C_retStat != HAL_OK)
    {
        return SEN_ERROR;
    }
#else

    if (HAL_OK != HAL_I2C_Mem_Write(&SENSORS_I2C_HANDLER, deviceAddress, WriteAddr, 1, &Data, 1, 10))
      return SEN_ERROR;
#endif
  
  return SEN_SUCCESS;
}


/* Private functions ---------------------------------------------------------*/


/*******************************************************************************
* Function Name  : AIS328DQ_GetWHO_AM_I
* Description    : Read identification code from AIS328DQ_WHO_AM_I register
* Input          : char to be filled with the Device identification Value
* Output         : None
* Return         : Status [value of FSS]
*******************************************************************************/
status_t AIS328DQ_GetWHO_AM_I(uint8_t deviceAddress, uint8_t* val){
  
  if( !AIS328DQ_ReadReg(deviceAddress, AIS328DQ_WHO_AM_I, val) )
    return SEN_ERROR;
  
  if (*val != AIS328DQ_WHO_AM_I_VAL)
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetODR
* Description    : Sets AIS328DQ Accelerometer Output Data Rate 
* Input          : Output Data Rate
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetODR(uint8_t deviceAddress, AIS328DQ_ODR_t dr){
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(deviceAddress, AIS328DQ_CTRL_REG1, &value) )
    return SEN_ERROR;
  
  value &= 0xE7;
  value |= dr<<AIS328DQ_DR;
  
  if( !AIS328DQ_WriteReg(deviceAddress, AIS328DQ_CTRL_REG1, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetMode
* Description    : Sets AIS328DQ Accelerometer Operating Mode
* Input          : Modality (AIS328DQ_LOW_POWER, AIS328DQ_NORMAL, AIS328DQ_POWER_DOWN...)
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetMode(uint8_t deviceAddress, AIS328DQ_Mode_t pm) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(deviceAddress, AIS328DQ_CTRL_REG1, &value) )
    return SEN_ERROR;
  
  value &= 0x1F;
  value |= (pm<<AIS328DQ_PM);   
  
  if( !AIS328DQ_WriteReg(deviceAddress, AIS328DQ_CTRL_REG1, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}

/*******************************************************************************
* Function Name  : AIS328DQ_SetAxis
* Description    : Enable/Disable AIS328DQ Axis
* Input          : AIS328DQ_X_ENABLE/AIS328DQ_X_DISABLE | AIS328DQ_Y_ENABLE/AIS328DQ_Y_DISABLE
                   | AIS328DQ_Z_ENABLE/AIS328DQ_Z_DISABLE
* Output         : None
* Note           : You MUST use all input variable in the argument, as example
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetAxis(uint8_t deviceAddress, AIS328DQ_Axis_t axis) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(deviceAddress, AIS328DQ_CTRL_REG1, &value) )
    return SEN_ERROR;
  
  value &= 0xF8;
  value |= (0x07 & axis);
  
  if( !AIS328DQ_WriteReg(deviceAddress, AIS328DQ_CTRL_REG1, value) )
    return SEN_ERROR;   
  
  return SEN_SUCCESS;
}


