ace-stratton/ES-SDK/6.0.4.sdk/espf/arch/stm32h753iit/drivers/sensors/acc_ais328dq/ais328dq_driver.c
/*******************************************************************************
* Function Name  : AIS328DQ_SetFullScale
* Description    : Sets the AIS328DQ FullScale
* Input          : AIS328DQ_FULLSCALE_2/AIS328DQ_FULLSCALE_4/AIS328DQ_FULLSCALE_8
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetFullScale(uint8_t deviceAddress, AIS328DQ_Fullscale_t fs) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(deviceAddress, AIS328DQ_CTRL_REG4, &value) )
    return SEN_ERROR;
  
  value &= 0xCF;	
  value |= (fs<<AIS328DQ_FS);
  
  if( !AIS328DQ_WriteReg(deviceAddress, AIS328DQ_CTRL_REG4, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetBDU
* Description    : Enable/Disable Block Data Update Functionality
* Input          : MEMS_ENABLE/MEMS_DISABLE
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetBDU(State_t bdu) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG4, &value) )
    return SEN_ERROR;
  
  value &= 0x7F;
  value |= (bdu<<AIS328DQ_BDU);
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG4, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetBLE
* Description    : Set Endianess (MSB/LSB)
* Input          : AIS328DQ_BLE_LSB / AIS328DQ_BLE_MSB
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetBLE(AIS328DQ_Endianess_t ble) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG4, &value) )
    return SEN_ERROR;
  
  value &= 0xBF;	
  value |= (ble<<AIS328DQ_BLE);
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG4, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetFDS
* Description    : Set Filter Data Selection
* Input          : MEMS_ENABLE/MEMS_DISABLE
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetFDS(State_t fds) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG2, &value) )
    return SEN_ERROR;
  
  value &= 0xEF;	
  value |= (fds<<AIS328DQ_FDS);
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG2, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetBOOT
* Description    : Rebot memory content
* Input          : MEMS_ENABLE/MEMS_DISABLE
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetBOOT(State_t boot) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG2, &value) )
    return SEN_ERROR;
  
  value &= 0x7F;	
  value |= (boot<<AIS328DQ_BOOT);
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG2, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetSelfTest
* Description    : Set Self Test Modality
* Input          : MEMS_DISABLE/MEMS_ENABLE
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetSelfTest(State_t st) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG4, &value) )
    return SEN_ERROR;
  
  value &= 0xFD;
  value |= (st<<AIS328DQ_ST);
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG4, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetSelfTestSign
* Description    : Set Self Test Sign (Disable = st_plus, Enable = st_minus)
* Input          : MEMS_DISABLE/MEMS_ENABLE
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetSelfTestSign(State_t st_sign) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG4, &value) )
    return SEN_ERROR;
  
  value &= 0xF7;
  value |= (st_sign<<AIS328DQ_ST_SIGN);
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG4, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetIntHighLow
* Description    : Set Interrupt active state (Disable = active high, Enable = active low)
* Input          : MEMS_DISABLE/MEMS_ENABLE
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetIntHighLow(State_t ihl) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG3, &value) )
    return SEN_ERROR;
  
  value &= 0x7F;
  value |= (ihl<<AIS328DQ_IHL);
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG3, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetIntPPOD
* Description    : Set Interrupt Push-Pull/OpenDrain Pad (Disable = Push-Pull, Enable = OpenDrain)
* Input          : MEMS_DISABLE/MEMS_ENABLE
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetIntPPOD(State_t pp_od) {
  uint8_t value;
  
