ace-stratton/ES-SDK/6.0.4.sdk/espf/arch/stm32h753iit/drivers/sensors/acc_ais328dq/ais328dq_driver.c
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG3, &value) )
    return SEN_ERROR;
  
  value &= 0xBF;
  value |= (pp_od<<AIS328DQ_PP_OD);
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG3, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetInt1DataSign
* Description    : Set Data signal Interrupt 1 pad
* Input          : Modality by AIS328DQ_INT_Conf_t Typedef 
                  (AIS328DQ_INT_SOURCE, AIS328DQ_INT_1OR2_SOURCE, AIS328DQ_DATA_READY, AIS328DQ_BOOT_RUNNING)
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetInt1DataSign(AIS328DQ_INT_Conf_t i_cfg) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG3, &value) )
    return SEN_ERROR;
  
  value &= 0xFC;
  value |= (i_cfg<<AIS328DQ_I1_CFG);
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG3, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetInt2DataSign
* Description    : Set Data signal Interrupt 2 pad
* Input          : Modality by AIS328DQ_INT_Conf_t Typedef 
                  (AIS328DQ_INT_SOURCE, AIS328DQ_INT_1OR2_SOURCE, AIS328DQ_DATA_READY, AIS328DQ_BOOT_RUNNING)
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetInt2DataSign(AIS328DQ_INT_Conf_t i_cfg) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG3, &value) )
    return SEN_ERROR;
  
  value &= 0xE7;
  value |= (i_cfg<<AIS328DQ_I2_CFG);
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG3, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetSPI34Wire
* Description    : Set SPI mode 
* Input          : Modality by AIS328DQ_SPIMode_t Typedef (AIS328DQ_SPI_4_WIRE, AIS328DQ_SPI_3_WIRE)
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetSPI34Wire(AIS328DQ_SPIMode_t sim) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG4, &value) )
    return SEN_ERROR;
  
  value &= 0xFE;
  value |= (sim<<AIS328DQ_SIM);
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG4, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_TurnONEnable
* Description    : TurnON Mode selection for sleep to wake function
* Input          : AIS328DQ_SLEEP_TO_WAKE_DIS/AIS328DQ_SLEEP_TO_WAKE_ENA
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_TurnONEnable(AIS328DQ_Sleep_To_Wake_Conf_t stw) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG5, &value) )
    return SEN_ERROR;
  
  value &= 0x00;
  value |= (stw<<AIS328DQ_TURN_ON);
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG5, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_HPFilterReset
* Description    : Reading register for reset the content of internal HP filter
* Input          : None
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_HPFilterReset(void) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_HP_FILTER_RESET, &value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetReference
* Description    : Sets Reference register acceleration value as a reference for HP filter
* Input          : Value of reference acceleration value (0-255)
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetReference(int8_t ref) {
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_REFERENCE_REG, ref) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetHPFMode
* Description    : Set High Pass Filter Modality
* Input          : AIS328DQ_HPM_NORMAL_MODE_RES/AIS328DQ_HPM_REF_SIGNAL/AIS328DQ_HPM_NORMAL_MODE
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetHPFMode(AIS328DQ_HPFMode_t hpm) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG2, &value) )
    return SEN_ERROR;
  
  value &= 0x9F;
  value |= (hpm<<AIS328DQ_HPM);
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG2, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetHPFCutOFF
* Description    : Set High Pass CUT OFF Freq
* Input          : AIS328DQ_HPFCF [0,3]
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetHPFCutOFF(AIS328DQ_HPFCutOffFreq_t hpf) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG2, &value) )
    return SEN_ERROR;
  
