ace-stratton/ES-SDK/6.0.4.sdk/espf/arch/stm32h753iit/drivers/sensors/acc_ais328dq/ais328dq_driver.c
  value &= 0xFC;
  value |= (hpf<<AIS328DQ_HPCF);
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG2, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
  
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetInt2HPEnable
* Description    : Set Interrupt2 hp filter enable/disable
* Input          : MEMS_ENABLE/MEMS_DISABLE
* example        : AIS328DQ_SetInt2HPEnable(MEMS_ENABLE)
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetInt2HPEnable(State_t stat) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG2, &value) )
    return SEN_ERROR;
  
  value &= 0xF7;
  value |= stat<<AIS328DQ_HPEN2 ;
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG2, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}     


/*******************************************************************************
* Function Name  : AIS328DQ_SetInt1HPEnable
* Description    : Set Interrupt1 hp filter enable/disable
* Input          : MEMS_ENABLE/MEMS_DISABLE
* example        : AIS328DQ_SetInt1HPEnable(MEMS_ENABLE)
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetInt1HPEnable(State_t stat) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG2, &value) )
    return SEN_ERROR;
  
  value &= 0xFB;
  value |= stat<<AIS328DQ_HPEN1 ;
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG2, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}  


/*******************************************************************************
* Function Name  : AIS328DQ_Int1LatchEnable
* Description    : Enable Interrupt 1 Latching function
* Input          : ENABLE/DISABLE
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_Int1LatchEnable(State_t latch) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG3, &value) )
    return SEN_ERROR;
  
  value &= 0xFB;
  value |= latch<<AIS328DQ_LIR1;
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG3, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_Int2LatchEnable
* Description    : Enable Interrupt 2 Latching function
* Input          : ENABLE/DISABLE
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_Int2LatchEnable(State_t latch) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG3, &value) )
    return SEN_ERROR;
  
  value &= 0xDF;
  value |= latch<<AIS328DQ_LIR2;
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_CTRL_REG3, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_ResetInt1Latch
* Description    : Reset Interrupt 1 Latching function
* Input          : None
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_ResetInt1Latch(void) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_INT1_SRC, &value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_ResetInt2Latch
* Description    : Reset Interrupt 2 Latching function
* Input          : None
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_ResetInt2Latch(void) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_INT2_SRC, &value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetInt1Configuration
* Description    : Interrupt 1 Configuration (without 6D_INT)
* Input          : AIS328DQ_INT_AND/OR | AIS328DQ_INT_ZHIE_ENABLE/DISABLE | AIS328DQ_INT_ZLIE_ENABLE/DISABLE...
* Output         : None
* Note           : You MUST use ALL input variable in the argument, as in example above
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetInt1Configuration(AIS328DQ_IntConf_t ic) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_INT1_CFG, &value) )
    return SEN_ERROR;
  
  value &= 0x40; 
  value |= ic;
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_INT1_CFG, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetInt2Configuration
* Description    : Interrupt 2 Configuration (without 6D_INT)
* Input          : AIS328DQ_INT_AND/OR | AIS328DQ_INT_ZHIE_ENABLE/DISABLE | AIS328DQ_INT_ZLIE_ENABLE/DISABLE...
* Output         : None
* Note           : You MUST use all input variable in the argument, as example
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetInt2Configuration(AIS328DQ_IntConf_t ic) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_INT2_CFG, &value) )
    return SEN_ERROR;
  
  value &= 0x40; 
  value |= ic;
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_INT2_CFG, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


