ace-stratton/ES-SDK/6.0.4.sdk/espf/arch/stm32h753iit/drivers/sensors/acc_ais328dq/ais328dq_driver.c
/*******************************************************************************
* Function Name  : AIS328DQ_SetInt1Mode
* Description    : Interrupt 1 Configuration mode (OR, 6D Movement, AND, 6D Position)
* Input          : AIS328DQ_INT_MODE_OR, AIS328DQ_INT_MODE_6D_MOVEMENT, AIS328DQ_INT_MODE_AND, AIS328DQ_INT_MODE_6D_POSITION
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetInt1Mode(AIS328DQ_IntMode_t int_mode) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_INT1_CFG, &value) )
    return SEN_ERROR;
  
  value &= 0x3F; 
  value |= (int_mode<<AIS328DQ_INT_6D);
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_INT1_CFG, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetInt2Mode
* Description    : Interrupt 2 Configuration mode (OR, 6D Movement, AND, 6D Position)
* Input          : AIS328DQ_INT_MODE_OR, AIS328DQ_INT_MODE_6D_MOVEMENT, AIS328DQ_INT_MODE_AND, AIS328DQ_INT_MODE_6D_POSITION
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetInt2Mode(AIS328DQ_IntMode_t int_mode) {
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_INT2_CFG, &value) )
    return SEN_ERROR;
  
  value &= 0x3F; 
  value |= (int_mode<<AIS328DQ_INT_6D);
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_INT2_CFG, value) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_Get6DPositionInt1
* Description    : 6D Interrupt 1 Position Detect
* Input          : Byte to be filled with AIS328DQ_POSITION_6D_t Typedef
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_Get6DPositionInt1(uint8_t* val){
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_INT1_SRC, &value) )
    return SEN_ERROR;
  
  value &= 0x7F;
  
  switch (value){
  case AIS328DQ_UP_SX:   
    *val = AIS328DQ_UP_SX;    
    break;
  case AIS328DQ_UP_DX:   
    *val = AIS328DQ_UP_DX;    
    break;
  case AIS328DQ_DW_SX:   
    *val = AIS328DQ_DW_SX;    
    break;
  case AIS328DQ_DW_DX:   
    *val = AIS328DQ_DW_DX;    
    break;
  case AIS328DQ_TOP:     
    *val = AIS328DQ_TOP;      
    break;
  case AIS328DQ_BOTTOM:  
    *val = AIS328DQ_BOTTOM;  
    break;

  default:
      return SEN_ERROR;
      break;
  }
  
  return SEN_SUCCESS;  
}


/*******************************************************************************
* Function Name  : AIS328DQ_Get6DPositionInt2
* Description    : 6D Interrupt 2 Position Detect
* Input          : Byte to be filled with AIS328DQ_POSITION_6D_t Typedef
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_Get6DPositionInt2(uint8_t* val){
  uint8_t value;
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_INT2_SRC, &value) )
    return SEN_ERROR;
  
  value &= 0x7F;
  
  switch (value){
  case AIS328DQ_UP_SX:   
    *val = AIS328DQ_UP_SX;    
    break;
  case AIS328DQ_UP_DX:   
    *val = AIS328DQ_UP_DX;    
    break;
  case AIS328DQ_DW_SX:   
    *val = AIS328DQ_DW_SX;    
    break;
  case AIS328DQ_DW_DX:   
    *val = AIS328DQ_DW_DX;    
    break;
  case AIS328DQ_TOP:     
    *val = AIS328DQ_TOP;      
    break;
  case AIS328DQ_BOTTOM:  
    *val = AIS328DQ_BOTTOM;   
    break;

  default:
      return SEN_ERROR;
      break;
  }
  
  return SEN_SUCCESS;  
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetInt1Threshold
* Description    : Sets Interrupt 1 Threshold
* Input          : Threshold = [0,127]
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetInt1Threshold(uint8_t ths) {
  if (ths > 127)
    return SEN_ERROR;
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_INT1_THS, ths) )
    return SEN_ERROR;    
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetInt1Duration
* Description    : Sets Interrupt 1 Duration
* Input          : Duration = [0,127]
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetInt1Duration(uint8_t id) {  
  if (id > 127)
    return SEN_ERROR;
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_INT1_DURATION, id) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetInt2Threshold
* Description    : Sets Interrupt 2 Threshold
* Input          : Threshold = [0,127]
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetInt2Threshold(uint8_t ths) {
  if (ths > 127)
    return SEN_ERROR;
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_INT2_THS, ths) )
    return SEN_ERROR;    
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_SetInt2Duration
* Description    : Sets Interrupt 2 Duration
* Input          : Duration = [0,127]
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_SetInt2Duration(uint8_t id) {  
  if (id > 127)
    return SEN_ERROR;
  
  if( !AIS328DQ_WriteReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_INT2_DURATION, id) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


