ace-stratton/ES-SDK/6.0.4.sdk/espf/arch/stm32h753iit/drivers/sensors/acc_ais328dq/ais328dq_driver.c
/*******************************************************************************
* Function Name  : AIS328DQ_GetStatusReg
* Description    : Read the status register
* Input          : char to empty by Status Reg Value
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_GetStatusReg(uint8_t* val) {
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_STATUS_REG, val) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;  
}

/*******************************************************************************
* Function Name  : AIS328DQ_GetStatusBIT
* Description    : Read the status register BIT
* Input          : AIS328DQ_STATUS_REG_ZYXOR, AIS328DQ_STATUS_REG_ZOR, AIS328DQ_STATUS_REG_YOR, AIS328DQ_STATUS_REG_XOR,
                   AIS328DQ_STATUS_REG_ZYXDA, AIS328DQ_STATUS_REG_ZDA, AIS328DQ_STATUS_REG_YDA, AIS328DQ_STATUS_REG_XDA, 
                   AIS328DQ_DATAREADY_BIT
* Output         : status register BIT
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_GetStatusBit(uint8_t statusBIT, uint8_t *val) {
  uint8_t value;  
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_STATUS_REG, &value) )
    return SEN_ERROR;
  
  switch (statusBIT){
  case AIS328DQ_STATUS_REG_ZYXOR:     
    if(value &= AIS328DQ_STATUS_REG_ZYXOR){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }  
  case AIS328DQ_STATUS_REG_ZOR:       
    if(value &= AIS328DQ_STATUS_REG_ZOR){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }  
  case AIS328DQ_STATUS_REG_YOR:       
    if(value &= AIS328DQ_STATUS_REG_YOR){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }                                 
  case AIS328DQ_STATUS_REG_XOR:       
    if(value &= AIS328DQ_STATUS_REG_XOR){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }  
  case AIS328DQ_STATUS_REG_ZYXDA:     
    if(value &= AIS328DQ_STATUS_REG_ZYXDA){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }   
  case AIS328DQ_STATUS_REG_ZDA:       
    if(value &= AIS328DQ_STATUS_REG_ZDA){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }   
  case AIS328DQ_STATUS_REG_YDA:       
    if(value &= AIS328DQ_STATUS_REG_YDA){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }   
  case AIS328DQ_STATUS_REG_XDA:       
    if(value &= AIS328DQ_STATUS_REG_XDA){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }

  default:
      return SEN_ERROR;
      break;
  }
  
  return SEN_ERROR;
}


/*******************************************************************************
* Function Name  : AIS328DQ_GetAccAxesRaw
* Description    : Read the Acceleration Values Output Registers
* Input          : buffer to empity by AccAxesRaw_t Typedef
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_GetAccAxesRaw(uint8_t deviceAddr, AxesRaw_t* buff) {
  int16_t value;
  uint8_t *valueL = (uint8_t *)(&value);
  uint8_t *valueH = ((uint8_t *)(&value)+1);
  
  if( !AIS328DQ_ReadReg(deviceAddr, AIS328DQ_OUT_X_L, valueL) )
    return SEN_ERROR;
  
  if( !AIS328DQ_ReadReg(deviceAddr, AIS328DQ_OUT_X_H, valueH) )
    return SEN_ERROR;
  
  buff->AXIS_X = value/16;
  
  if( !AIS328DQ_ReadReg(deviceAddr, AIS328DQ_OUT_Y_L, valueL) )
    return SEN_ERROR;
  
  if( !AIS328DQ_ReadReg(deviceAddr, AIS328DQ_OUT_Y_H, valueH) )
    return SEN_ERROR;
  
  buff->AXIS_Y = value/16;
  
  if( !AIS328DQ_ReadReg(deviceAddr, AIS328DQ_OUT_Z_L, valueL) )
    return SEN_ERROR;
  
  if( !AIS328DQ_ReadReg(deviceAddr, AIS328DQ_OUT_Z_H, valueH) )
    return SEN_ERROR;
  
  buff->AXIS_Z = value/16;
  
  return SEN_SUCCESS;  
}


/*******************************************************************************
* Function Name  : AIS328DQ_GetInt1Src
* Description    : Reset Interrupt 1 Latching function
* Input          : buffer to empty by Int1 Source Value
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_GetInt1Src(uint8_t* val) {  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_INT1_SRC, val) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_GetInt2Src
* Description    : Reset Interrupt 2 Latching function
* Input          : buffer to empty by Int2 Source Value
* Output         : None
* Return         : Status [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_GetInt2Src(uint8_t* val) {  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_INT2_SRC, val) )
    return SEN_ERROR;
  
  return SEN_SUCCESS;
}


/*******************************************************************************
* Function Name  : AIS328DQ_GetInt1SrcBit
* Description    : Reset Interrupt 1 Latching function
* Input          : AIS328DQ_INT1_SRC_IA, AIS328DQ_INT1_SRC_ZH, AIS328DQ_INT1_SRC_ZL .....
* Output         : None
* Return         : Status of BIT [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_GetInt1SrcBit(uint8_t statusBIT, uint8_t *val) {
  uint8_t value;  
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_INT1_SRC, &value) )
    return SEN_ERROR;
  
  if(statusBIT == AIS328DQ_INT_SRC_IA){
    if(value &= AIS328DQ_INT_SRC_IA){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }    
  }
  
  if(statusBIT == AIS328DQ_INT_SRC_ZH){
    if(value &= AIS328DQ_INT_SRC_ZH){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }   
  }
  
  if(statusBIT == AIS328DQ_INT_SRC_ZL){
    if(value &= AIS328DQ_INT_SRC_ZL){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }   
  }
  
  if(statusBIT == AIS328DQ_INT_SRC_YH){
    if(value &= AIS328DQ_INT_SRC_YH){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }   
  }
  
  if(statusBIT == AIS328DQ_INT_SRC_YL){
    if(value &= AIS328DQ_INT_SRC_YL){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }  
  }
  
  if(statusBIT == AIS328DQ_INT_SRC_XH){
    if(value &= AIS328DQ_INT_SRC_XH){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }   
  }
  
  if(statusBIT == AIS328DQ_INT_SRC_XL){
    if(value &= AIS328DQ_INT_SRC_XL){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }    
  } 
  return SEN_ERROR;
}


