ace-stratton/ES-SDK/6.0.4.sdk/espf/arch/stm32h753iit/drivers/sensors/acc_ais328dq/ais328dq_driver.c
/*******************************************************************************
* Function Name  : AIS328DQ_GetInt2SrcBit
* Description    : Reset Interrupt 2 Latching function
* Input          : AIS328DQ_INT_SRC_IA, AIS328DQ_INT_SRC_ZH, AIS328DQ_INT_SRC_ZL .....
* Output         : None
* Return         : Status of BIT [SEN_ERROR, SEN_SUCCESS]
*******************************************************************************/
status_t AIS328DQ_GetInt2SrcBit(uint8_t statusBIT, uint8_t *val) {
  uint8_t value;  
  
  if( !AIS328DQ_ReadReg(AIS328DQ_1_MEMS_I2C_ADDRESS, AIS328DQ_INT2_SRC, &value) )
    return SEN_ERROR;
  
  if(statusBIT == AIS328DQ_INT_SRC_IA){
    if(value &= AIS328DQ_INT_SRC_IA){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }   
  }
  
  if(statusBIT == AIS328DQ_INT_SRC_ZH){
    if(value &= AIS328DQ_INT_SRC_ZH){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }  
  }
  
  if(statusBIT == AIS328DQ_INT_SRC_ZL){
    if(value &= AIS328DQ_INT_SRC_ZL){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }  
  }
  
  if(statusBIT == AIS328DQ_INT_SRC_YH){
    if(value &= AIS328DQ_INT_SRC_YH){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }    
  }
  
  if(statusBIT == AIS328DQ_INT_SRC_YL){
    if(value &= AIS328DQ_INT_SRC_YL){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }   
  }
  
  if(statusBIT == AIS328DQ_INT_SRC_XH){
    if(value &= AIS328DQ_INT_SRC_XH){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }  
  }
  
  if(statusBIT == AIS328DQ_INT_SRC_XL){
    if(value &= AIS328DQ_INT_SRC_XL){     
      *val = MEMS_SET;
      return SEN_SUCCESS;
    }
    else{  
      *val = MEMS_RESET;
      return SEN_SUCCESS;
    }    
  } 
  return SEN_ERROR;
}
/******************* (C) COPYRIGHT 2012 STMicroelectronics *****END OF FILE****/
